balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F6585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D20" edc:desc="" edc:mask="0x1" edc:name="B4D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D21" edc:desc="" edc:mask="0x1" edc:name="B4D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D22" edc:desc="" edc:mask="0x1" edc:name="B4D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D23" edc:desc="" edc:mask="0x1" edc:name="B4D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D24" edc:desc="" edc:mask="0x1" edc:name="B4D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D25" edc:desc="" edc:mask="0x1" edc:name="B4D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D26" edc:desc="" edc:mask="0x1" edc:name="B4D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D27" edc:desc="" edc:mask="0x1" edc:name="B4D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D30" edc:desc="" edc:mask="0x1" edc:name="B4D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D31" edc:desc="" edc:mask="0x1" edc:name="B4D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D32" edc:desc="" edc:mask="0x1" edc:name="B4D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D33" edc:desc="" edc:mask="0x1" edc:name="B4D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D34" edc:desc="" edc:mask="0x1" edc:name="B4D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D35" edc:desc="" edc:mask="0x1" edc:name="B4D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D36" edc:desc="" edc:mask="0x1" edc:name="B4D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D37" edc:desc="" edc:mask="0x1" edc:name="B4D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D40" edc:desc="" edc:mask="0x1" edc:name="B4D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D41" edc:desc="" edc:mask="0x1" edc:name="B4D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D42" edc:desc="" edc:mask="0x1" edc:name="B4D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D43" edc:desc="" edc:mask="0x1" edc:name="B4D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D44" edc:desc="" edc:mask="0x1" edc:name="B4D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D45" edc:desc="" edc:mask="0x1" edc:name="B4D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D46" edc:desc="" edc:mask="0x1" edc:name="B4D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D47" edc:desc="" edc:mask="0x1" edc:name="B4D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D50" edc:desc="" edc:mask="0x1" edc:name="B4D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D51" edc:desc="" edc:mask="0x1" edc:name="B4D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D52" edc:desc="" edc:mask="0x1" edc:name="B4D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D53" edc:desc="" edc:mask="0x1" edc:name="B4D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D54" edc:desc="" edc:mask="0x1" edc:name="B4D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D55" edc:desc="" edc:mask="0x1" edc:name="B4D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D56" edc:desc="" edc:mask="0x1" edc:name="B4D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D57" edc:desc="" edc:mask="0x1" edc:name="B4D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D60" edc:desc="" edc:mask="0x1" edc:name="B4D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D61" edc:desc="" edc:mask="0x1" edc:name="B4D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D62" edc:desc="" edc:mask="0x1" edc:name="B4D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D63" edc:desc="" edc:mask="0x1" edc:name="B4D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D64" edc:desc="" edc:mask="0x1" edc:name="B4D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D65" edc:desc="" edc:mask="0x1" edc:name="B4D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D66" edc:desc="" edc:mask="0x1" edc:name="B4D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D67" edc:desc="" edc:mask="0x1" edc:name="B4D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D70" edc:desc="" edc:mask="0x1" edc:name="B4D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D71" edc:desc="" edc:mask="0x1" edc:name="B4D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D72" edc:desc="" edc:mask="0x1" edc:name="B4D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D73" edc:desc="" edc:mask="0x1" edc:name="B4D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D74" edc:desc="" edc:mask="0x1" edc:name="B4D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D75" edc:desc="" edc:mask="0x1" edc:name="B4D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D76" edc:desc="" edc:mask="0x1" edc:name="B4D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D77" edc:desc="" edc:mask="0x1" edc:name="B4D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="B46D77" edc:desc="" edc:mask="0x1" edc:name="B46D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO5" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO5" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0_FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1_FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2_FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B5CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B5CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0_TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1_TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2_RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3_TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4_TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RTRRO_TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1_TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL_TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0_TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1_TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2_RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3_TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4_TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RTRRO_TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1_TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL_TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B5SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B5SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
