balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F6585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D10" edc:desc="" edc:mask="0x1" edc:name="TXB2D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D11" edc:desc="" edc:mask="0x1" edc:name="TXB2D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D12" edc:desc="" edc:mask="0x1" edc:name="TXB2D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D13" edc:desc="" edc:mask="0x1" edc:name="TXB2D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D14" edc:desc="" edc:mask="0x1" edc:name="TXB2D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D15" edc:desc="" edc:mask="0x1" edc:name="TXB2D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D16" edc:desc="" edc:mask="0x1" edc:name="TXB2D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D17" edc:desc="" edc:mask="0x1" edc:name="TXB2D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D20" edc:desc="" edc:mask="0x1" edc:name="TXB2D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D21" edc:desc="" edc:mask="0x1" edc:name="TXB2D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D22" edc:desc="" edc:mask="0x1" edc:name="TXB2D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D23" edc:desc="" edc:mask="0x1" edc:name="TXB2D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D24" edc:desc="" edc:mask="0x1" edc:name="TXB2D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D25" edc:desc="" edc:mask="0x1" edc:name="TXB2D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D26" edc:desc="" edc:mask="0x1" edc:name="TXB2D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D27" edc:desc="" edc:mask="0x1" edc:name="TXB2D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D30" edc:desc="" edc:mask="0x1" edc:name="TXB2D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D31" edc:desc="" edc:mask="0x1" edc:name="TXB2D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D32" edc:desc="" edc:mask="0x1" edc:name="TXB2D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D33" edc:desc="" edc:mask="0x1" edc:name="TXB2D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D34" edc:desc="" edc:mask="0x1" edc:name="TXB2D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D35" edc:desc="" edc:mask="0x1" edc:name="TXB2D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D36" edc:desc="" edc:mask="0x1" edc:name="TXB2D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D37" edc:desc="" edc:mask="0x1" edc:name="TXB2D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D40" edc:desc="" edc:mask="0x1" edc:name="TXB2D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D41" edc:desc="" edc:mask="0x1" edc:name="TXB2D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D42" edc:desc="" edc:mask="0x1" edc:name="TXB2D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D43" edc:desc="" edc:mask="0x1" edc:name="TXB2D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D44" edc:desc="" edc:mask="0x1" edc:name="TXB2D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D45" edc:desc="" edc:mask="0x1" edc:name="TXB2D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D46" edc:desc="" edc:mask="0x1" edc:name="TXB2D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D47" edc:desc="" edc:mask="0x1" edc:name="TXB2D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D50" edc:desc="" edc:mask="0x1" edc:name="TXB2D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D51" edc:desc="" edc:mask="0x1" edc:name="TXB2D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D52" edc:desc="" edc:mask="0x1" edc:name="TXB2D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D53" edc:desc="" edc:mask="0x1" edc:name="TXB2D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D54" edc:desc="" edc:mask="0x1" edc:name="TXB2D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D55" edc:desc="" edc:mask="0x1" edc:name="TXB2D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D56" edc:desc="" edc:mask="0x1" edc:name="TXB2D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D57" edc:desc="" edc:mask="0x1" edc:name="TXB2D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
